let questions = [
    {
        "question":"周五下班後，同事提議要一起去吃熱炒店，這個時候你覺得?",
        "answers":[
            ["好哇好哇！我最喜歡熱鬧的場合了",2],
            ["我都可以耶，大家都去的話我也去好了",2],
            ["不是很想耶…我猶豫一下好了",2],
            ["我不想去耶…",2]
        ]
    },
    {
        "question":"到店內了，大家一起在熱炒店裡點餐，這個時候你會?",
        "answers":[
            ["沒關係，大家吃什麼我就吃什麼～",3],
            ["問問沒說話的人有沒有想吃的",3],
            ["大聲提議我想吃的餐點！",3],
            ["我想吃這個，但我不敢說...",3]
        ]
    },
    {
        "question":"大家吃到一半，氣氛正好，決定開瓶酒來喝，但你最好的同事酒量極差，這時你會?",
        "answers":[
            ["「沒關係，分攤下來也不貴，大家一起出吧」",4],
            ["「不要緊張，我幫你喝！」",4],
            ["「他不喝酒！我們喝的人分掉～」",4],
            ["「要幫他點果汁嗎？」",4]
        ]
    },
    {
        "question":"小酌一番的飯局結束後，興致高昂，大家相約續攤去唱歌，在KTV的你…",
        "answers":[
            ["我是大家會推我上台唱歌的那種類型！",5],
            ["耶！我喜歡唱歌～我對唱歌很有自信",5],
            ["我不會唱歌，但沒關係！可以跟大家一起去",5],
            ["我喜歡聽著大家唱歌的氣氛",5]
        ]
    },
    {
        "question":"回家時間！快樂的聚會結束了，看著狀況各有不同的同事們，你會?",
        "answers":[
            ["看著大家的糗態覺得很可愛、有趣","N"],
            ["提醒大家回家要小心，到家要報備","N"],
            ["我還可以再續攤！！！","N"],
            ["我來幫喝醉的人叫車～","N"]
        ]
    }
];

let score = [0,0,0,0,0,0,0,0];

let optionScore=[
    [4,1,4,3,2,1,2,3],[3,2,3,4,1,2,1,4],[2,3,2,1,4,3,4,1],[1,4,1,2,3,4,3,2],
    [2,3,1,4,2,3,1,4],[4,1,3,2,4,1,3,2],[3,2,4,1,3,2,4,1],[1,4,2,3,1,4,2,3],
    [3,1,3,4,2,2,4,1],[4,2,4,3,1,1,3,2],[1,3,1,2,4,4,2,3],[2,4,2,1,3,3,1,4],
    [4,1,3,4,1,2,3,2],[3,2,4,3,2,1,4,1],[2,3,1,2,3,4,1,4],[1,4,2,1,4,3,2,3],
    [3,1,3,4,2,1,4,2],[1,3,1,2,4,3,2,4],[4,2,4,3,1,2,3,1],[2,4,2,1,3,4,1,3]
];

let finalAnswers=["a.jpg","b.jpg","c.jpg","d.jpg","e.jpg","f.jpg","g.jpg","h.jpg"];